---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.RevitElementId
source: html/ea394f2e-6929-ca71-5ebd-6c29566a39bf.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.RevitElementId Property

The id of the owning Revit element.

## Syntax (C#)
```csharp
public ElementId RevitElementId { get; }
```